XuanSama02/STM32H750_POLARIS_BSP/Drivers/SYSTEM/SYS/sys.h
#ifndef __SYS_H
#define __SYS_H
#include "stm32h7xx.h"
#include "core_cm7.h"
#include "stm32h7xx_hal.h"

/**
 * https://github.com/XuanSama02
 * @auther:  XuanSama02
 * @date:    2022/08/18
 * @brif:    北极星开发板系统初始化支持
 * @version:
 * 1.0：定义了常用数据类型的短关键字
 */

#define SYSTEM_SUPPORT_OS 0  //定义系统文件夹是否支持OS

//定义一些常用的数据类型短关键字

typedef int32_t s32;
typedef int16_t s16;
typedef int8_t  s8;

typedef const int32_t sc32;
typedef const int16_t sc16;
typedef const int8_t  sc8;

typedef __IO int32_t vs32;
typedef __IO int16_t vs16;
typedef __IO int8_t  vs8;

typedef __I int32_t vsc32;
typedef __I int16_t vsc16;
typedef __I int8_t  vsc8;

typedef uint32_t u32;
typedef uint16_t u16;
typedef uint8_t  u8;

typedef const uint32_t uc32;
typedef const uint16_t uc16;
typedef const uint8_t  uc8;

typedef __IO uint32_t vu32;
typedef __IO uint16_t vu16;
typedef __IO uint8_t  vu8;

typedef __I uint32_t vuc32;
typedef __I uint16_t vuc16;
typedef __I uint8_t  vuc8;

#define ON	1
#define OFF	0

#define Cache_Write_Through() (*(__IO uint32_t*)0XE000EF9C = 1UL<<2)  //Cache透写模式

u8 stm32_clock_init(u32 plln, u32 pllm, u32 pllp, u32 pllq);  //配置系统时钟
void stm32_cache_enable(void);                                //使能STM32H7的L1-Cahce
u8 stm32_icache_stastu(void);                                 //判断I_Cache是否打开
u8 stm32_dcache_status(void);                                 //判断I_Dache是否打开
void qspi_memmap_mode(void);                                  //QSPI进入内存映射模式

#if defined(__clang__)    //使用V6编译器(clang)

void __attribute__((noinline)) WFI_SET(void);
void __attribute__((noinline)) INTX_DISABLE(void);
void __attribute__((noinline)) INTX_ENABLE(void);
void __attribute__((noinline)) MSR_MSP(u32 addr);

#elif defined(__CC_ARM)   //使用V5编译器(ARMCC)

void WFI_SET(void);       //执行WFI指令
void INTX_DISABLE(void);  //关闭所有中断
void INTX_ENABLE(void);   //开启所有中断
void MSR_MSP(u32 addr);   //设置堆栈地址

#endif

#endif
